STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_HAP_Central/STM32_WPAN/App/hap_app.c
extern void APP_NotifyToRun(void);

/* Functions Definition ------------------------------------------------------*/

void HAPAPP_Init(void)
{
  tBleStatus status;
  uint8_t i;
  /* Init Initiator/Commander with Unicast Client */
  status = CAPAPP_Init(AUDIO_ROLE_SOURCE | AUDIO_ROLE_SINK);
  LOG_INFO_APP("CAPAPP_Init() returns status 0x%02X\n",status);
  Set_Volume(BASE_VOLUME);
  Menu_SetLocalVolume(BASE_VOLUME);

  for (i = 0; i < APP_HAP_NUM_PRESETS; i++)
  {
    aPresetRecord[i].Index = 0x00;
  }

  if (status == BLE_STATUS_SUCCESS)
  {
    /* Initialize the HAP layer*/
    status = HAPAPP_HAPInit(APP_HAP_ROLE);
    LOG_INFO_APP("HAPAPP_HAPInit() with role 0x%02X returns status 0x%02X\n", APP_HAP_ROLE, status);
    UNUSED(status);
  }
}

tBleStatus HAPAPP_Linkup(uint16_t ConnHandle)
{
  tBleStatus status = HCI_COMMAND_DISALLOWED_ERR_CODE;
  APP_ACL_Conn_t *p_conn = APP_GetACLConn(ConnHandle);
  if (p_conn != 0)
  {
    /* Perform CAP linkup restoration if profiles are already present in NVM, else start Complete linkup process */
    GAF_Profiles_Link_t NVMLink = 0;
    if (p_conn->ForceCompleteLinkup == 0)
    {
      NVMLink = CAP_DB_GetPresentGAFProfiles(p_conn->Peer_Address_Type,p_conn->Peer_Address);
      LOG_INFO_APP("GAF Profiles Mask 0x%02X present in NVM\n",NVMLink);
    }
    if (NVMLink != 0)
    {
      GAF_Profiles_Link_t link = 0x00u;
      GAF_Profiles_Link_t current_link = CAP_GetCurrentLinkedProfiles(ConnHandle);

      LOG_INFO_APP("profiles 0x%02X of the GAF are already linked on ConnHandle 0x%04x\n",
                  current_link,
                  ConnHandle);
      if (current_link != NVMLink)
      {
        link = NVMLink & (~current_link);
        status = CAP_Linkup(ConnHandle,link,0x00u);
        LOG_INFO_APP("CAP_Linkup() for GAF restoration on ConnHandle 0x%04x for link mask 0x%02X returns status 0x%02X\n",
                    ConnHandle,
                    link,
                    status);
        HAPAPP_Context.InitState = HAP_APP_INIT_STATE_CAP_LINKUP;
      }
      else
      {
        LOG_INFO_APP("All profiles (link mask 0x%02X) of the GAF are already linked on ConnHandle 0x%04x\n",
                    link,
                    ConnHandle);
        status = BLE_STATUS_FAILED;
      }
    }
    else
    {
      GAF_Profiles_Link_t link = 0x00u;
      if (p_conn->Role == 0x00u)
      {
        /*Local device is Master*/
        if (APP_CAP_Config.Role  & CAP_ROLE_INITIATOR)
        {
          if ((APP_BAP_Config.Role & BAP_ROLE_UNICAST_CLIENT) == BAP_ROLE_UNICAST_CLIENT)
          {
            link |= BAP_UNICAST_LINK;
          }
        }
        if (APP_CAP_Config.Role  & CAP_ROLE_COMMANDER)
        {
          if ((APP_BAP_Config.Role & BAP_ROLE_BROADCAST_ASSISTANT) == BAP_ROLE_BROADCAST_ASSISTANT)
          {
            link |= BAP_BA_LINK;
          }
          if ((APP_VCP_Config.Role & VCP_ROLE_CONTROLLER) == VCP_ROLE_CONTROLLER)
          {
            link |= VCP_LINK;
          }
          if ((APP_MICP_Config.Role & MICP_ROLE_CONTROLLER) == MICP_ROLE_CONTROLLER)
          {
            link |= MICP_LINK;
          }
        }
        if ((APP_CAP_Config.Role & (CAP_ROLE_INITIATOR | CAP_ROLE_COMMANDER)) != 0)
        {
          if ((APP_CSIP_Config.Role & CSIP_ROLE_SET_COORDINATOR) == CSIP_ROLE_SET_COORDINATOR)
          {
            link |= CSIP_LINK;
          }
        }
      }
      else if (p_conn->Role == 0x01u)
      {
        if ((APP_CAP_Config.Role & (CAP_ROLE_ACCEPTOR | CAP_ROLE_COMMANDER)) != 0)
        {
          /* local device is Slave*/
          if ((((p_conn->AudioProfile & AUDIO_PROFILE_CCP) == 0) && ((APP_CCP_Config.Role & CCP_ROLE_CLIENT) == CCP_ROLE_CLIENT)) \
            || (((p_conn->AudioProfile & AUDIO_PROFILE_MCP) == 0) && ((APP_MCP_Config.Role & MCP_ROLE_CLIENT) == MCP_ROLE_CLIENT)))
          {
            if ((APP_CCP_Config.Role & CCP_ROLE_CLIENT) == CCP_ROLE_CLIENT)
            {
              link |= CCP_LINK;
            }
            if ((APP_MCP_Config.Role & MCP_ROLE_CLIENT) == MCP_ROLE_CLIENT)
            {
              link |= MCP_LINK;
            }
          }
        }
      }
      if (link != 0x00u)
      {
        GAF_Profiles_Link_t current_link = CAP_GetCurrentLinkedProfiles(ConnHandle);

        LOG_INFO_APP("profiles 0x%02X of the GAF are already linked on ConnHandle 0x%04x\n",
                    current_link,
                    ConnHandle);
        if (current_link != link)
        {
          link = link & (~current_link);
          status = CAP_Linkup(ConnHandle,link,0x01u);
          LOG_INFO_APP("CAP_Linkup() on ConnHandle 0x%04x for link mask 0x%02X returns status 0x%02X\n",
                      ConnHandle,
                      link,
                      status);
          HAPAPP_Context.InitState = HAP_APP_INIT_STATE_CAP_LINKUP;
        }
        else
        {
          LOG_INFO_APP("All profiles (link mask 0x%02X) of the GAF are already linked on ConnHandle 0x%04x\n",
                      link,
                      ConnHandle);
          status = BLE_STATUS_FAILED;
        }
      }
    }
  }
  return status;
}

/**
  * @brief  Notify CAP Events
  * @param  pNotification: pointer on notification information
 */
void CAP_Notification(CAP_Notification_Evt_t *pNotification)
{
  /* Notify HAP */
  CAP_HAP_Notification(pNotification);

  /* Notify App */
  HAPAPP_CAPNotification(pNotification);
}

/**
  * @brief  Notify HAP Events
  * @param  pNotification: pointer on notification information
 */
void HAP_Notification(HAP_Notification_Evt_t *pNotification)
{
  switch(pNotification->EvtOpcode)
  {
    case HAP_LINKUP_COMPLETE_EVT:
    {
      tBleStatus ret;
      APP_ACL_Conn_t *p_conn = 0u;
      LOG_INFO_APP("HAP Linkup Complete Event with ConnHandle 0x%04X is received with status 0x%02X\n",
                  pNotification->ConnHandle,
                  pNotification->Status);
      p_conn = APP_GetACLConn(pNotification->ConnHandle);
      if (pNotification->Status == BLE_STATUS_SUCCESS)
      {
        if (p_conn != 0)
        {
          p_conn->AudioProfile |= AUDIO_PROFILE_HAP;
        }
      }
      Menu_SetNoStreamPage();
      if (p_conn != 0)
      {
        if (p_conn->ConfirmIndicationRequired == 1u)
        {
          /* Confirm indication now that the GATT is available */
          ret = aci_gatt_confirm_indication(pNotification->ConnHandle);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : aci_gatt_confirm_indication command, result: 0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("  Success: aci_gatt_confirm_indication command\n");
          }
          p_conn->ConfirmIndicationRequired = 0u;
        }
      }
      ret = HAP_HARC_ReadPresetsRequest(pNotification->ConnHandle, 0x01, HAP_MAX_PRESET_NUM);
      LOG_INFO_APP("HAP_HARC_ReadPresetsRequest() returns status 0x%02X\n", ret);
      HAPAPP_Context.InitState = HAP_APP_INIT_STATE_READ_PRESETS;
      UNUSED(ret);
      break;
    }

    case HAP_HARC_HA_FEATURES_EVT:
    {
      HAP_HA_Features_t ha_features = pNotification->pInfo[0];
      LOG_INFO_APP("HAP HA Features received: 0x%02X\n", ha_features);
      UNUSED(ha_features);
      break;
    }
    case HAP_HARC_ACTIVE_PRESET_INDEX_EVT:
    {
      uint8_t active_preset_index = pNotification->pInfo[0];
      uint8_t i, j;
      LOG_INFO_APP("HAP Active Preset received: %d\n", active_preset_index);

      if (pNotification->Status == BLE_STATUS_SUCCESS)
      {
        ActivePreset = active_preset_index;
        for (i = 0; i < APP_HAP_NUM_PRESETS; i++)
        {
          if (aPresetRecord[i].Index == active_preset_index)
          {
            Menu_SetPresetID(active_preset_index);
            Menu_SetPresetName((char *) aPresetRecord[i].Name);
            break;
          }
        }
        for (i = 0; i < CFG_BLE_NUM_LINK; i++)
        {
          if (pNotification->ConnHandle == HAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle)
          {
            HAPAPP_Context.ACL_Conn[i].active_preset = active_preset_index;
            for (j = 0; j < CFG_BLE_NUM_LINK; j++)
            {
              if (HAPAPP_Context.ACL_Conn[j].active_preset != active_preset_index)
              {
                HAPAPP_SetActivePreset(HAPAPP_Context.ACL_Conn[j].Acl_Conn_Handle, active_preset_index);
                break;
              }
            }
            break;
          }
        }
      }

      break;
    }
    case HAP_HARC_READ_PRESET_RESPONSE_EVT:
    {
      HAP_ReadPresetResponse_Info_t *p_read_response = (HAP_ReadPresetResponse_Info_t *) pNotification->pInfo;
      uint8_t i;
      char name[HAP_MAX_PRESET_NAME_LEN + 1];
      memcpy(&name[0], &p_read_response->Preset.Name[0], p_read_response->Preset.NameLen);
      name[p_read_response->Preset.NameLen] = '\0';
      LOG_INFO_APP("HAP Read Preset Response received:\n");
      LOG_INFO_APP("    - Index = %d\n", p_read_response->Preset.Index);
      LOG_INFO_APP("    - Name = %s\n", name);
      LOG_INFO_APP("    - Properties = %02X\n", p_read_response->Preset.Properties);
      LOG_INFO_APP("    - IsLast = %d\n", p_read_response->IsLast);

      /* Check if id correspond to already added preset record */
      for (i = 0; i < APP_HAP_NUM_PRESETS; i++)
      {
        if (aPresetRecord[i].Index == p_read_response->Preset.Index)
        {
          memcpy(&aPresetRecord[i].Name[0], &p_read_response->Preset.Name[0], p_read_response->Preset.NameLen);
          aPresetRecord[i].Name[p_read_response->Preset.NameLen] = '\0';
          aPresetRecord[i].Properties = p_read_response->Preset.Properties;
          break;
        }
      }

