STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_HAP_Central/STM32_WPAN/App/hap_app.c
      if (i == APP_HAP_NUM_PRESETS)
      {
        /* No preset found, find empty preset record */
        for (i = 0; i < APP_HAP_NUM_PRESETS; i++)
        {
          if (aPresetRecord[i].Index == 0)
          {
            aPresetRecord[i].Index = p_read_response->Preset.Index;
            memcpy(&aPresetRecord[i].Name[0], &p_read_response->Preset.Name[0], p_read_response->Preset.NameLen);
            aPresetRecord[i].Name[p_read_response->Preset.NameLen] = '\0';
            aPresetRecord[i].Properties = p_read_response->Preset.Properties;
            break;
          }
        }
      }

      if (p_read_response->IsLast == 1u)
      {
        for (i = 0; i < APP_HAP_NUM_PRESETS; i++)
        {
          if (aPresetRecord[i].Index == ActivePreset)
          {
            /* Set active preset */
            Menu_SetPresetID(ActivePreset);
            Menu_SetPresetName((char *) aPresetRecord[i].Name);
            break;
          }
        }
      }

      break;
    }
    case HAP_HARC_PRESET_RECORD_UPDATE_EVT:
    {
      HAP_PresetUpdate_Info_t *p_preset_update = (HAP_PresetUpdate_Info_t *) pNotification->pInfo;
      char name[HAP_MAX_PRESET_NAME_LEN + 1];
      memcpy(&name[0], &p_preset_update->Preset.Name[0], p_preset_update->Preset.NameLen);
      name[p_preset_update->Preset.NameLen] = '\0';
      LOG_INFO_APP("HAP Preset Record Update received:\n");
      LOG_INFO_APP("    - Index = %d\n", p_preset_update->Preset.Index);
      LOG_INFO_APP("    - Name = %s\n", name);
      LOG_INFO_APP("    - Properties = %02X\n", p_preset_update->Preset.Properties);
      LOG_INFO_APP("    - PrevIndex = %d\n", p_preset_update->PrevIndex);
      LOG_INFO_APP("    - IsLast = %d\n", p_preset_update->IsLast);
      UNUSED(p_preset_update);
      UNUSED(name);
      break;
    }
    case HAP_HARC_PRESET_RECORD_DELETED_EVT:
    {
      HAP_PresetChangedIndex_Info_t *p_preset_changed = (HAP_PresetChangedIndex_Info_t *) pNotification->pInfo;
      LOG_INFO_APP("Preset record with index %d is deleted\n", p_preset_changed->Index);
      UNUSED(p_preset_changed);
      break;
    }
    case HAP_HARC_PRESET_RECORD_AVAILABLE_EVT:
    {
      HAP_PresetChangedIndex_Info_t *p_preset_changed = (HAP_PresetChangedIndex_Info_t *) pNotification->pInfo;
      LOG_INFO_APP("Preset record with index %d is available\n", p_preset_changed->Index);
      UNUSED(p_preset_changed);
      break;
    }
    case HAP_HARC_PRESET_RECORD_UNAVAILABLE_EVT:
    {
      HAP_PresetChangedIndex_Info_t *p_preset_changed = (HAP_PresetChangedIndex_Info_t *) pNotification->pInfo;
      LOG_INFO_APP("Preset record with index %d is unavailable\n", p_preset_changed->Index);
      UNUSED(p_preset_changed);
      break;
    }
    case HAP_HARC_PROC_COMPLETE_EVT:
    {
      APP_ACL_Conn_t *p_conn = 0u;
      tBleStatus ret;
      LOG_INFO_APP("HAP HARC Procedure Complete received\n");

      p_conn = APP_GetACLConn(pNotification->ConnHandle);

      if (HAPAPP_Context.InitState == HAP_APP_INIT_STATE_READ_ACTIVE_PRESET)
      {
        ret = HAP_HARC_ReadPresetsRequest(pNotification->ConnHandle, 0x01, HAP_MAX_PRESET_NUM);
        LOG_INFO_APP("HAP_HARC_ReadPresetsRequest() returns status 0x%02X\n", ret);
        HAPAPP_Context.InitState = HAP_APP_INIT_STATE_READ_PRESETS;
        UNUSED(ret);
      }
      else if (HAPAPP_Context.InitState == HAP_APP_INIT_STATE_READ_PRESETS)
      {
#if (CFG_BLE_NUM_LINK > 0u)
        /*Check if a CAP Linkup with a discovered Set Member should started*/
        for (uint8_t i = 0; i < CFG_BLE_NUM_LINK; i++)
        {
          if (HAPAPP_Context.ACL_Conn[i].CSIPDiscovered == 1u)
          {
            ret = HAPAPP_Linkup(HAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle);
            LOG_INFO_APP("HAPAPP_Linkup() on ConnHandle 0x%04X returns status 0x%02X\n",
                        HAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle,
                        ret);
            if (ret == BLE_STATUS_SUCCESS)
            {
              return;
            }
          }
        }
#endif /*(CFG_BLE_NUM_LINK > 0u)*/
        if( HAPAPP_Context.SetMemberDiscoveryProcActive == 1u)
        {
          if (p_conn != 0)
          {
            /* Check if a new Set Member discovery should be started */
            if ((p_conn->AudioProfile & AUDIO_PROFILE_CSIP) == AUDIO_PROFILE_CSIP)
            {
              uint8_t num_members = 0u;
#if (CFG_BLE_NUM_LINK > 0u)
              for (uint8_t i = 0; i < CFG_BLE_NUM_LINK; i++)
              {
                if ((HAPAPP_Context.ACL_Conn[i].AudioProfile & AUDIO_PROFILE_CSIP) == AUDIO_PROFILE_CSIP)
                {
                  if ((HAPAPP_Context.ACL_Conn[i].SIRK_type == p_conn->SIRK_type) \
                     && (memcmp(&HAPAPP_Context.ACL_Conn[i].SIRK[0], &p_conn->SIRK[0],16u) == 0u))
                  {
                    num_members++;
                  }
                }
                else if (HAPAPP_Context.ACL_Conn[i].CSIPDiscovered == 1u)
                {
                    num_members++;
                }
              }
#endif /*(CFG_BLE_NUM_LINK > 0u)*/
              LOG_INFO_APP("Number of Set Members discovered %d on %d\n", num_members,p_conn->Size);
              if (num_members < p_conn->Size)
              {
                /* Start scanning */
                HAPAPP_StartScanning();
                /* perform discovery to another potential Coordinated Set Member*/
                if (CAP_StartCoordinatedSetMemberDiscoveryProcedure(pNotification->ConnHandle) == BLE_STATUS_SUCCESS)
                {
                  HAPAPP_Context.InitState = HAP_APP_INIT_STATE_SET_MEMBER_DISC;
                  return;
                }
                else
                {
                  ret = aci_gap_terminate_gap_proc(GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC);
                  if (ret != BLE_STATUS_SUCCESS)
                  {
                    LOG_INFO_APP("  Fail   : aci_gap_terminate_gap_proc command, result: 0x%02X\n", ret);
                  }
                  else
                  {
                    LOG_INFO_APP("  Success: aci_gap_terminate_gap_proc command\n");
                  }
                }
              }
            }
          }
        }
#if (APP_VCP_ROLE_CONTROLLER_SUPPORT == 1u)
        ret = CAP_VolumeController_StartSetVolumeProcedure(pNotification->ConnHandle, BASE_VOLUME);
        LOG_INFO_APP("CAP_VolumeController_StartSetVolumeProcedure() returns status 0x%02X\n", ret);
        Menu_SetRemoteVolume(BASE_VOLUME);
        HAPAPP_Context.InitState = HAP_APP_INIT_STATE_SET_VOLUME;
        HAPAPP_Context.OperationConnHandle = pNotification->ConnHandle;
        UNUSED(ret);
#endif /* (APP_VCP_ROLE_CONTROLLER_SUPPORT == 1u) */
      }
      break;
    }

    default:
      break;
  }
}

uint8_t HAPAPP_StartScanning(void)
{
  uint8_t status;
  Scan_Param_Phy_t scan_param_phy;
  scan_param_phy.Scan_Type = 0x00; /*Passive scanning*/
  scan_param_phy.Scan_Interval = 0x50;
  scan_param_phy.Scan_Window = 0x50;

  status = aci_gap_ext_start_scan(0x00,
                                   GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC,
                                   0x00,
                                   0x01,
                                   0x0000,
                                   0x0000,
                                   0x00,
                                   0x01,
                                   &scan_param_phy);
  LOG_INFO_APP("aci_gap_ext_start_scan() returns status 0x%02X\n",status);

