STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_HAP_Central/STM32_WPAN/App/hap_app.c
  return status;
}

uint8_t HAPAPP_StopScanning(void)
{
  uint8_t status;

  status = aci_gap_terminate_gap_proc(GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC);
  LOG_INFO_APP("aci_gap_terminate_gap_proc() returns status 0x%02X\n",status);

  return status;
}

uint8_t HAPAPP_CreateConnection(uint8_t *pAddress, uint8_t AddressType)
{
  uint8_t status;

  status = aci_gap_create_connection(0x0400,
                                     0x0400,
                                     AddressType,
                                     pAddress,
                                     0x00,
                                     0x20,
                                     0x20,
                                     0x0000,
                                     0x03E8,
                                     0x0000,
                                     0x03E8);
  LOG_INFO_APP("aci_gap_create_connection() returns status 0x%02X\n",status);
  return status;
}

uint8_t HAPAPP_Disconnect(void)
{
  uint8_t status = BLE_STATUS_FAILED;
  for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
  {
    if ( HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu)
    {
      status = hci_disconnect(HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle,
                              HCI_REMOTE_USER_TERMINATED_CONNECTION_ERR_CODE);
      LOG_INFO_APP("hci_disconnect() of ConnHandle 0x%04X returns status 0x%02X\n",
                   HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle,
                   status);
    }
  }

  return status;
}

uint8_t HAPAPP_StartMediaStream(void)
{
  uint8_t status;
  uint8_t metadata_snk_len = 0;
  uint8_t num_acceptors = 0u;
  uint8_t conn_ref = 0u;
  APP_ACL_Conn_t *p_conn;
  CAP_Set_Acceptors_t set_type = CAP_SET_TYPE_AD_HOC;

  HAPAPP_Context.audio_driver_config = AUDIO_DRIVER_CONFIG_LINEIN;
  LOG_INFO_APP("Start Media Stream\n");

  for (uint8_t conn = 0u; ((conn < CFG_BLE_NUM_LINK) && (num_acceptors < MAX_UNICAST_ACCEPTORS)) ; conn++)
  {
    if (num_acceptors == 0u)
    {
      if (( HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu) \
          && ((HAPAPP_Context.ACL_Conn[conn].UnicastServerInfo.AudioRole & AUDIO_ROLE_SINK ) == AUDIO_ROLE_SINK))
      {
        StartStreamParams[num_acceptors].ConnHandle = HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle;
        StartStreamParams[num_acceptors].StreamRole = AUDIO_ROLE_SINK;
        if ( (HAPAPP_Context.ACL_Conn[conn].AudioProfile & AUDIO_PROFILE_CSIP) == AUDIO_PROFILE_CSIP)
        {
          set_type = CAP_SET_TYPE_CSIP;
          conn_ref = conn;
        }
        else
        {
          /* we start stream with only one acceptor*/
          num_acceptors++;
          break;
        }
        num_acceptors++;
      }
    }
    else
    {
      if (( HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu) \
          && ((HAPAPP_Context.ACL_Conn[conn].UnicastServerInfo.AudioRole & AUDIO_ROLE_SINK ) == AUDIO_ROLE_SINK))
      {
        if (set_type == CAP_SET_TYPE_CSIP)
        {
          /* Check that acceptor is in the same Coordinated Set*/
          if(memcmp(&HAPAPP_Context.ACL_Conn[conn].SIRK[0], &HAPAPP_Context.ACL_Conn[conn_ref].SIRK[0], 16u) == 0)
          {
            StartStreamParams[num_acceptors].ConnHandle = HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle;
            StartStreamParams[num_acceptors].StreamRole = AUDIO_ROLE_SINK;
            num_acceptors++;
          }
        }
      }
    }
  }


  for( uint8_t i = 0u; i < num_acceptors ; i++)
  {
    uint8_t num_chnls;
    metadata_snk_len = 0u;
    p_conn = APP_GetACLConn(StartStreamParams[i].ConnHandle);
    if (p_conn != 0)
    {
      CodecConfSnk[i].TargetLatency = TARGET_LATENCY_LOW;
      CodecConfSnk[i].TargetPhy = TARGET_LE_2M_PHY;
      CodecConfSnk[i].CodecID.CodingFormat = 0x06;
      CodecConfSnk[i].CodecID.CompanyID = 0x0000;
      CodecConfSnk[i].CodecID.VsCodecID = 0x0000;
      CodecConfSnk[i].CodecSpecificConfParams.SamplingFrequency = APP_CodecConf[MEDIA_STREAM_QOS_CONFIG%16].freq;
      CodecConfSnk[i].CodecSpecificConfParams.FrameDuration = APP_CodecConf[MEDIA_STREAM_QOS_CONFIG%16].frame_duration;
      CodecConfSnk[i].CodecSpecificConfParams.FrameBlockPerSdu = 1;
      CodecConfSnk[i].CodecSpecificConfParams.OctetPerCodecFrame = APP_CodecConf[MEDIA_STREAM_QOS_CONFIG%16].octets_per_codec_frame;
      if (num_acceptors == MAX_UNICAST_ACCEPTORS)
      {
        if ((p_conn->UnicastServerInfo.SnkAudioLocations & FRONT_LEFT) == FRONT_LEFT)
        {
          CodecConfSnk[i].AudioChannelAllocation = FRONT_LEFT;
        }
        else if ((p_conn->UnicastServerInfo.SnkAudioLocations & FRONT_RIGHT) == FRONT_RIGHT)
        {
          CodecConfSnk[i].AudioChannelAllocation = FRONT_RIGHT;
        }
        else
        {
          CodecConfSnk[i].AudioChannelAllocation = 0;
        }
        num_chnls = 1u;
        CodecConfSnk[i].ChannelPerCIS = 1u;
      }
      else
      {
        if (APP_GetBitsAudioChnlAllocations(p_conn->UnicastServerInfo.SnkAudioLocations) > 1u)
        {
          CodecConfSnk[i].AudioChannelAllocation = (FRONT_LEFT|FRONT_RIGHT);
          CodecConfSnk[i].ChannelPerCIS = 1u;
          num_chnls = 2u;
        }
        else
        {
          CodecConfSnk[i].AudioChannelAllocation = 0;
          CodecConfSnk[i].ChannelPerCIS = 1u;
          num_chnls = 1u;
        }
      }
      QosConfSnk[i].SDUInterval = APP_QoSConf[MEDIA_STREAM_QOS_CONFIG].sdu_interval;
      QosConfSnk[i].Framing = APP_QoSConf[MEDIA_STREAM_QOS_CONFIG].framing;
      QosConfSnk[i].MaxSDU = APP_QoSConf[MEDIA_STREAM_QOS_CONFIG].max_sdu \
        * MIN(num_chnls, CodecConfSnk[i].ChannelPerCIS);
      QosConfSnk[i].RetransmissionNumber = APP_QoSConf[MEDIA_STREAM_QOS_CONFIG].rtx_num;
      QosConfSnk[i].MaxTransportLatency = APP_QoSConf[MEDIA_STREAM_QOS_CONFIG].max_tp_latency;
      QosConfSnk[i].PresentationDelay = APP_QoSConf[MEDIA_STREAM_QOS_CONFIG].presentation_delay;

      aMetadataSnk[i][metadata_snk_len++] = 0x03;
      aMetadataSnk[i][metadata_snk_len++] = METADATA_STREAMING_AUDIO_CONTEXTS;
      aMetadataSnk[i][metadata_snk_len++] = (uint8_t) AUDIO_CONTEXT_MEDIA;
      aMetadataSnk[i][metadata_snk_len++] = (uint8_t) (AUDIO_CONTEXT_MEDIA >> 8);

