STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_HAP_Central/STM32_WPAN/App/hap_app.c
      StartStreamParams[i].StreamSnk.pCodecConf = &CodecConfSnk[i];
      StartStreamParams[i].StreamSnk.pQoSConf = &QosConfSnk[i];
      StartStreamParams[i].StreamSnk.pMetadata = &aMetadataSnk[i][0];
      StartStreamParams[i].StreamSnk.MetadataLen = metadata_snk_len;

      StartStreamParams[i].StreamSrc.pCodecConf = &CodecConfSrc[i];
      StartStreamParams[i].StreamSrc.pQoSConf = &QosConfSrc[i];
      StartStreamParams[i].StreamSrc.pMetadata = &aMetadataSrc[i][0];
      StartStreamParams[i].StreamSrc.MetadataLen = 0;
      LOG_INFO_APP("Set Start Stream for CAP Acceptor %d on connHandle 0x%04X :\n",i,StartStreamParams[i].ConnHandle);
      LOG_INFO_APP("Sink Codec Conf :\n");
      LOG_INFO_APP("    Audio Channel Allocation : 0x%08X\n",CodecConfSnk[i].AudioChannelAllocation);
      LOG_INFO_APP("    Channel Per CIS : %d\n",CodecConfSnk[i].ChannelPerCIS);
      LOG_INFO_APP("    Sampling Freq : 0x%02X\n",CodecConfSnk[i].CodecSpecificConfParams.SamplingFrequency);
    }
    else
    {
      return BLE_STATUS_FAILED;
    }
  }

  status = CAP_Unicast_AudioStart(set_type, num_acceptors, &StartStreamParams[0]);

  LOG_INFO_APP("CAP_Unicast_AudioStart() of %d CAP Accceptors in Set Type 0x%02X returns status %02X\n",
               num_acceptors,
               set_type,
               status);

  return status;
}

uint8_t HAPAPP_StartTelephonyStream(void)
{
  uint8_t status;
  uint8_t metadata_snk_len = 0;
  uint8_t metadata_src_len = 0;
  uint8_t num_acceptors = 0u;
  uint8_t conn_ref = 0u;
  uint8_t codec_conf_id = TELEPHONY_STREAM_QOS_CONFIG % 16;
  uint8_t qos_conf_id = TELEPHONY_STREAM_QOS_CONFIG;
  CAP_Set_Acceptors_t set_type = CAP_SET_TYPE_AD_HOC;
  Audio_Role_t cfg_audio_role = 0u;
  HAPAPP_Context.audio_driver_config = AUDIO_DRIVER_CONFIG_HEADSET;
  LOG_INFO_APP("Start Telephony Stream\n");

  for (uint8_t conn = 0u; ((conn < CFG_BLE_NUM_LINK) && (num_acceptors < MAX_UNICAST_ACCEPTORS)) ; conn++)
  {
    Audio_Role_t req_audio_role = AUDIO_ROLE_SINK;
    if (num_acceptors == 0u)
    {
      if ( HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu)
      {
        StartStreamParams[num_acceptors].ConnHandle = HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle;
        if ((cfg_audio_role & AUDIO_ROLE_SOURCE) == 0)
        {
          req_audio_role |= AUDIO_ROLE_SOURCE;
        }
        StartStreamParams[num_acceptors].StreamRole = (req_audio_role & HAPAPP_Context.ACL_Conn[conn].UnicastServerInfo.AudioRole);
        if ( (HAPAPP_Context.ACL_Conn[conn].AudioProfile & AUDIO_PROFILE_CSIP) == AUDIO_PROFILE_CSIP)
        {
          cfg_audio_role |= StartStreamParams[num_acceptors].StreamRole;
          set_type = CAP_SET_TYPE_CSIP;
          conn_ref = conn;
        }
        else
        {
          /* we start stream with only one acceptor*/
          num_acceptors++;
          break;
        }
        num_acceptors++;
      }
    }
    else
    {
      if ( HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu)
      {
        if (set_type == CAP_SET_TYPE_CSIP)
        {
          /* Check that acceptor is in the same Coordinated Set*/
          if(memcmp(&HAPAPP_Context.ACL_Conn[conn].SIRK[0], &HAPAPP_Context.ACL_Conn[conn_ref].SIRK[0], 16u) == 0)
          {
            StartStreamParams[num_acceptors].ConnHandle = HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle;
            cfg_audio_role = 0u;
            if ((cfg_audio_role & AUDIO_ROLE_SOURCE) == 0)
            {
              req_audio_role |= AUDIO_ROLE_SOURCE;
            }
            StartStreamParams[num_acceptors].StreamRole = ((req_audio_role) & HAPAPP_Context.ACL_Conn[conn].UnicastServerInfo.AudioRole);
            cfg_audio_role |= StartStreamParams[num_acceptors].StreamRole;
            num_acceptors++;
          }
        }
      }
    }
  }

  for( uint8_t i = 0u; i < num_acceptors ; i++)
  {
    metadata_snk_len = 0u;
    metadata_src_len = 0u;
    LOG_INFO_APP("Set Start Stream for CAP Acceptor %d on connHandle 0x%04X :\n",i,StartStreamParams[i].ConnHandle);
    for (Audio_Role_t role = AUDIO_ROLE_SINK; role <= AUDIO_ROLE_SOURCE;role++)
    {
      CAP_Unicast_AudioStart_Codec_Conf_t *pCodecConf;
      CAP_Unicast_AudioStart_QoS_Conf_t *pQoS_Conf;
      uint8_t num_chnls;
      if ((role & AUDIO_ROLE_SINK ) == AUDIO_ROLE_SINK)
      {
        pCodecConf = &CodecConfSnk[i];
        pQoS_Conf = &QosConfSnk[i];
      }
      else /* ((role & AUDIO_ROLE_SOURCE ) == AUDIO_ROLE_SOURCE)*/
      {
        pCodecConf = &CodecConfSrc[i];
        pQoS_Conf = &QosConfSrc[i];
      }

      if ((StartStreamParams[i].StreamRole & role ) == role)
      {
        pCodecConf->TargetLatency = TARGET_LATENCY_LOW;
        pCodecConf->TargetPhy = TARGET_LE_2M_PHY;
        pCodecConf->CodecID.CodingFormat = 0x06;
        pCodecConf->CodecID.CompanyID = 0x0000;
        pCodecConf->CodecID.VsCodecID = 0x0000;
        pCodecConf->CodecSpecificConfParams.SamplingFrequency = APP_CodecConf[codec_conf_id%16].freq;
        pCodecConf->CodecSpecificConfParams.FrameDuration = APP_CodecConf[codec_conf_id%16].frame_duration;
        pCodecConf->CodecSpecificConfParams.FrameBlockPerSdu = 1;
        pCodecConf->CodecSpecificConfParams.OctetPerCodecFrame = APP_CodecConf[codec_conf_id%16].octets_per_codec_frame;

        /* Set Mono channel for telephony as microphone IN is mono */
        pCodecConf->AudioChannelAllocation = 0;
        pCodecConf->ChannelPerCIS = 1u;
        num_chnls = 1u;

        pQoS_Conf->SDUInterval = APP_QoSConf[qos_conf_id].sdu_interval;
        pQoS_Conf->Framing = APP_QoSConf[qos_conf_id].framing;
        pQoS_Conf->MaxSDU = APP_QoSConf[qos_conf_id].max_sdu \
          * MIN(num_chnls, pCodecConf->ChannelPerCIS);
        pQoS_Conf->RetransmissionNumber = APP_QoSConf[qos_conf_id].rtx_num;
        pQoS_Conf->MaxTransportLatency = APP_QoSConf[qos_conf_id].max_tp_latency;
        pQoS_Conf->PresentationDelay = APP_QoSConf[qos_conf_id].presentation_delay;

        if ((role & AUDIO_ROLE_SINK ) == AUDIO_ROLE_SINK)
        {
          aMetadataSnk[i][metadata_snk_len++] = 0x03;
          aMetadataSnk[i][metadata_snk_len++] = METADATA_STREAMING_AUDIO_CONTEXTS;
          aMetadataSnk[i][metadata_snk_len++] = (uint8_t) AUDIO_CONTEXT_CONVERSATIONAL;
          aMetadataSnk[i][metadata_snk_len++] = (uint8_t) (AUDIO_CONTEXT_CONVERSATIONAL >> 8);
          aMetadataSnk[i][metadata_snk_len++] = 0x02;
          aMetadataSnk[i][metadata_snk_len++] = METADATA_CCID_LIST;
          aMetadataSnk[i][metadata_snk_len++] = APP_CCP_START_CCID;
          StartStreamParams[i].StreamSnk.pCodecConf = pCodecConf;
          StartStreamParams[i].StreamSnk.pQoSConf = pQoS_Conf;
          StartStreamParams[i].StreamSnk.pMetadata = &aMetadataSnk[i][0];
          StartStreamParams[i].StreamSnk.MetadataLen = metadata_snk_len;
          LOG_INFO_APP("Sink Codec Conf :\n");
          LOG_INFO_APP("    Audio Channel Allocation : 0x%08X\n",pCodecConf->AudioChannelAllocation);
          LOG_INFO_APP("    Channel Per CIS : %d\n",pCodecConf->ChannelPerCIS);
          LOG_INFO_APP("    Sampling Freq : 0x%02X\n",pCodecConf->CodecSpecificConfParams.SamplingFrequency);
        }
        else if ((role & AUDIO_ROLE_SOURCE ) == AUDIO_ROLE_SOURCE)
        {
          aMetadataSrc[i][metadata_src_len++] = 0x03;
          aMetadataSrc[i][metadata_src_len++] = METADATA_STREAMING_AUDIO_CONTEXTS;
          aMetadataSrc[i][metadata_src_len++] = (uint8_t) AUDIO_CONTEXT_CONVERSATIONAL;
          aMetadataSrc[i][metadata_src_len++] = (uint8_t) (AUDIO_CONTEXT_CONVERSATIONAL >> 8);
          aMetadataSrc[i][metadata_src_len++] = 0x02;
          aMetadataSrc[i][metadata_src_len++] = METADATA_CCID_LIST;
          aMetadataSrc[i][metadata_src_len++] = APP_CCP_START_CCID;
          StartStreamParams[i].StreamSrc.pCodecConf = pCodecConf;
          StartStreamParams[i].StreamSrc.pQoSConf = pQoS_Conf;
          StartStreamParams[i].StreamSrc.pMetadata = &aMetadataSrc[i][0];
          StartStreamParams[i].StreamSrc.MetadataLen = metadata_src_len;
          LOG_INFO_APP("Source Codec Conf :\n");
          LOG_INFO_APP("    Audio Channel Allocation : 0x%08X\n",pCodecConf->AudioChannelAllocation);
          LOG_INFO_APP("    Channel Per CIS : %d\n",pCodecConf->ChannelPerCIS);
          LOG_INFO_APP("    Sampling Freq : 0x%02X\n",pCodecConf->CodecSpecificConfParams.SamplingFrequency);
        }
      }
    }
  }

