STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_HAP_Central/STM32_WPAN/App/hap_app.c
        case CCP_CS_LOCALLY_REMOTELY_HELD:
          LOG_INFO_APP("     Call State : LOCALLY AND REMOTELY HELD\n");
          Menu_SetCallState("HELD");
        break;
      }
      LOG_INFO_APP("     Call Flags : 0x%02X\n",bearer_info->CallFlags);
      if (bearer_info->CallURILength > 0u)
      {
        uint8_t i;
        LOG_INFO_APP("     Call URI : ");
        for (i = 0; i < bearer_info->CallURILength; i++)
        {
          LOG_INFO_APP("%c",bearer_info->pCallURI[i]);
        }
        LOG_INFO_APP("\n");
      }
      break;
    }

    default:
      break;
  }
  UNUSED(status);
}
#endif /* (APP_CCP_ROLE_SERVER_SUPPORT == 1u) */

#if (APP_VCP_ROLE_CONTROLLER_SUPPORT == 1u)
static void VCP_MetaEvt_Notification(VCP_Notification_Evt_t *pNotification)
{
  switch(pNotification->EvtOpcode)
  {
    case VCP_CONTROLLER_UPDATED_VOLUME_STATE_EVT:
    {
      VCP_VolumeState_Evt_t *p_info = (VCP_VolumeState_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Updated Volume State :\n");
      LOG_INFO_APP("     Volume Setting : %d\n",p_info->VolSetting);
      LOG_INFO_APP("     Mute : %d\n",p_info->Mute);
      LOG_INFO_APP("     Change Counter : %d\n",p_info->ChangeCounter);

      RemoteVolume = p_info->VolSetting;
      RemoteMute = p_info->Mute;
      if (RemoteMute == 0)
      {
        Menu_SetRemoteVolume(p_info->VolSetting);
      }
      else
      {
        Menu_SetRemoteVolume(0);
      }
    }
    default:
      break;
  }
}
#endif /* (APP_VCP_ROLE_CONTROLLER_SUPPORT == 1u) */

#if (APP_MICP_ROLE_CONTROLLER_SUPPORT == 1u)
static void MICP_MetaEvt_Notification(MICP_Notification_Evt_t *pNotification)
{
  switch(pNotification->EvtOpcode)
  {
    case MICP_CONTROLLER_MUTE_EVT:
    {
      LOG_INFO_APP("MICP Mute value %d on ConnHandle 0x%04X\n", pNotification->pInfo[0u], pNotification->ConnHandle);
      RemoteMicMute = pNotification->pInfo[0u];
      Menu_SetRemoteMicMute(RemoteMicMute);
      break;
    }
    case MICP_CONTROLLER_OPERATION_COMPLETE_EVT:
    {
      MICP_CLT_OpComplete_Evt_t *p_info = (MICP_CLT_OpComplete_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("MICP Controller operation 0x%02X with connection handle 0x%04X on Instance %d is complete with status 0x%02X\n",
                  p_info->Op,
                  p_info->Inst,
                  pNotification->ConnHandle,
                  pNotification->Status);
      UNUSED(p_info);
      break;
    }
    case MICP_CONTROLLER_CTRL_OPERATION_TRANSMITTED_EVT:
    {
      MICP_CLT_CtrlOpTransmitted_Evt_t *p_info = (MICP_CLT_CtrlOpTransmitted_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("MICP Controller Ctrl operation 0x%02X  with connection handle 0x%04X on Instance %d is transmitted with status 0x%02X\n",
                  p_info->CtrlOp,
                  p_info->Inst,
                  pNotification->ConnHandle,
                  pNotification->Status);
      UNUSED(p_info);
      break;
    }
    case MICP_CONTROLLER_UPDATED_MUTE_EVT:
    {
      LOG_INFO_APP("New MICP Mute value %d on ConnHandle 0x%04X\n", pNotification->pInfo[0u], pNotification->ConnHandle);
      RemoteMicMute = pNotification->pInfo[0u];
      Menu_SetRemoteMicMute(RemoteMicMute);
      break;
    }
    case MICP_CONTROLLER_AUDIO_INPUT_STATE_EVT:
    {
      MICP_AudioInputState_Evt_t *p_info = (MICP_AudioInputState_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[AIC %d] Updated Audio Input State :\n",p_info->AICInst);
      LOG_INFO_APP("     Gain Setting : %d\n",p_info->State.GainSetting);
      LOG_INFO_APP("     Mute : %d\n",p_info->State.Mute);
      LOG_INFO_APP("     Gain Mode : %d\n",p_info->State.GainMode);
      LOG_INFO_APP("     Change Counter : %d\n",p_info->ChangeCounter);
      UNUSED(p_info);
      break;
    }
    case MICP_CONTROLLER_GAIN_SETTING_PROP_EVT:
    {
      MICP_GainSettingProp_Evt_t *p_info = (MICP_GainSettingProp_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[AIC %d] Updated Gain Setting Properties :\n",p_info->AICInst);
      LOG_INFO_APP("     Gain Setting Units: %d dB \n",(p_info->Prop.GainSettingUnits * 0.1));
      LOG_INFO_APP("     Gain Setting Min : %d\n",p_info->Prop.GainSettingMin);
      LOG_INFO_APP("     Gain Setting Max : %d\n",p_info->Prop.GainSettingMax);
      UNUSED(p_info);
      break;
    }
    case MICP_CONTROLLER_AUDIO_INPUT_STATUS_EVT:
    {
      MICP_AudioInputStatus_Evt_t *p_info = (MICP_AudioInputStatus_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("[AIC %d] Updated Audio Input Status :\n",p_info->AICInst);
      LOG_INFO_APP("     Status: %d \n",p_info->Status);
      UNUSED(p_info);
      break;
    }
    case MICP_CONTROLLER_AUDIO_INPUT_DESCRIPTION_EVT:
    {
      MICP_AudioDescription_Evt_t *p_info = (MICP_AudioDescription_Evt_t *)pNotification->pInfo;
      uint8_t i;
      LOG_INFO_APP("[AIC %d] Updated Audio Input Description :\n",p_info->Inst);
      for (i = 0; i < p_info->DataLength;i++)
      {
        LOG_INFO_APP("%c",p_info->pData[i]);
      }
      LOG_INFO_APP("\n");
      UNUSED(p_info);
      UNUSED(i);
      break;
    }
    default:
      break;
  }
}
#endif /* (APP_MICP_ROLE_CONTROLLER_SUPPORT == 1u) */

/* USER CODE BEGIN FD */

/* USER CODE END FD */

